Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML22_DFP/3.2.39/edc/ATSAML22G18A.PIC
      <edc:AdjustPoint edc:_addr="0x40000820" edc:offset="0x3E0"/>
      <edc:SFRDef edc:_addr="0x40000C00" edc:access="rrrr-rrr" edc:cname="RCAUSE" edc:impl="0xF7" edc:nzwidth="0x8" ltx:memberofperipheral="RSTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RSTC">
            <edc:SFRFieldDef edc:cname="POR" edc:desc="Power On Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BODCORE" edc:desc="Brown Out CORE Detector Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BODVDD" edc:desc="Brown Out VDD Detector Reset" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EXT" edc:desc="External Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDT" edc:desc="Watchdog Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SYST" edc:desc="System Reset Request" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BACKUP" edc:desc="Backup Reset" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40000C01" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x40000C02" edc:access="-----rr-" edc:cname="BKUPEXIT" edc:impl="0x6" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="RSTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RSTC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RTC" edc:desc="Real Timer Counter Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BBPS" edc:desc="Battery Backup Power Switch" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40000C03" edc:offset="0x3FD"/>
      <edc:SFRDef edc:_addr="0x40001000" edc:access="------------nnnn---nnnnn---n--nn" edc:cname="INTENCLR" edc:impl="0xF1F13" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="XOSCRDY" edc:desc="XOSC Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="XOSCFAIL" edc:desc="XOSC Clock Failure Detector Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OSC16MRDY" edc:desc="OSC16M Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DFLLRDY" edc:desc="DFLL Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLOOB" edc:desc="DFLL Out Of Bounds Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKF" edc:desc="DFLL Lock Fine Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKC" edc:desc="DFLL Lock Coarse Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLRCS" edc:desc="DFLL Reference Clock Stopped Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DPLLLCKR" edc:desc="DPLL Lock Rise Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPLLLCKF" edc:desc="DPLL Lock Fall Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPLLLTO" edc:desc="DPLL Time Out Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPLLLDRTO" edc:desc="DPLL Ratio Ready Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001004" edc:access="------------nnnn---nnnnn---n--nn" edc:cname="INTENSET" edc:impl="0xF1F13" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="XOSCRDY" edc:desc="XOSC Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="XOSCFAIL" edc:desc="XOSC Clock Failure Detector Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OSC16MRDY" edc:desc="OSC16M Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DFLLRDY" edc:desc="DFLL Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLOOB" edc:desc="DFLL Out Of Bounds Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKF" edc:desc="DFLL Lock Fine Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKC" edc:desc="DFLL Lock Coarse Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLRCS" edc:desc="DFLL Reference Clock Stopped Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DPLLLCKR" edc:desc="DPLL Lock Rise Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPLLLCKF" edc:desc="DPLL Lock Fall Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPLLLTO" edc:desc="DPLL Time Out Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPLLLDRTO" edc:desc="DPLL Ratio Ready Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001008" edc:access="------------nnnn---nnnnn---n--nn" edc:cname="INTFLAG" edc:impl="0xF1F13" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="XOSCRDY" edc:desc="XOSC Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="XOSCFAIL" edc:desc="XOSC Clock Failure Detector" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OSC16MRDY" edc:desc="OSC16M Ready" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DFLLRDY" edc:desc="DFLL Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLOOB" edc:desc="DFLL Out Of Bounds" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKF" edc:desc="DFLL Lock Fine" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKC" edc:desc="DFLL Lock Coarse" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLRCS" edc:desc="DFLL Reference Clock Stopped" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DPLLLCKR" edc:desc="DPLL Lock Rise" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPLLLCKF" edc:desc="DPLL Lock Fall" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPLLLTO" edc:desc="DPLL Timeout" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPLLLDRTO" edc:desc="DPLL Ratio Ready" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
