Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML22_DFP/3.2.39/edc/ATSAML22G18A.PIC
      <edc:SFRDef edc:_addr="0x41006041" edc:access="-n---nnn" edc:cname="GROUP0PINCFG1" edc:impl="0x47" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:desc="Select Peripheral Multiplexer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:desc="Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:desc="Pull Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:desc="Output Driver Strength Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41006042" edc:access="-n---nnn" edc:cname="GROUP0PINCFG2" edc:impl="0x47" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:desc="Select Peripheral Multiplexer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:desc="Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:desc="Pull Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:desc="Output Driver Strength Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41006043" edc:access="-n---nnn" edc:cname="GROUP0PINCFG3" edc:impl="0x47" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:desc="Select Peripheral Multiplexer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:desc="Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:desc="Pull Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:desc="Output Driver Strength Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41006044" edc:access="-n---nnn" edc:cname="GROUP0PINCFG4" edc:impl="0x47" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:desc="Select Peripheral Multiplexer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:desc="Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:desc="Pull Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:desc="Output Driver Strength Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41006045" edc:access="-n---nnn" edc:cname="GROUP0PINCFG5" edc:impl="0x47" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:desc="Select Peripheral Multiplexer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:desc="Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:desc="Pull Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:desc="Output Driver Strength Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41006046" edc:access="-n---nnn" edc:cname="GROUP0PINCFG6" edc:impl="0x47" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:desc="Select Peripheral Multiplexer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:desc="Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:desc="Pull Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:desc="Output Driver Strength Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41006047" edc:access="-n---nnn" edc:cname="GROUP0PINCFG7" edc:impl="0x47" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:desc="Select Peripheral Multiplexer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:desc="Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:desc="Pull Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:desc="Output Driver Strength Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41006048" edc:access="-n---nnn" edc:cname="GROUP0PINCFG8" edc:impl="0x47" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:desc="Select Peripheral Multiplexer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:desc="Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:desc="Pull Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:desc="Output Driver Strength Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41006049" edc:access="-n---nnn" edc:cname="GROUP0PINCFG9" edc:impl="0x47" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:desc="Select Peripheral Multiplexer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:desc="Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:desc="Pull Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:desc="Output Driver Strength Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100604A" edc:access="-n---nnn" edc:cname="GROUP0PINCFG10" edc:impl="0x47" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:desc="Select Peripheral Multiplexer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:desc="Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:desc="Pull Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:desc="Output Driver Strength Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
