Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML22_DFP/3.2.39/edc/ATSAML22G18A.PIC
      <edc:SFRDef edc:_addr="0x42003C04" edc:access="n---nnnnn---nnnn" edc:cname="CTRLB" edc:impl="0x8F8F" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="BBD" edc:desc="Bias Buffer Enable Duration" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="BBEN" edc:desc="Bias Buffer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LRD" edc:desc="Low Resistance Enable Duration" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="LREN" edc:desc="Low Resistance Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C06" edc:access="------nnnnnnnnnn" edc:cname="CTRLC" edc:impl="0x3FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="CLEAR" edc:desc="Clear Display Memory" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOCK" edc:desc="Lock Shadow Memory" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ABMEN" edc:desc="Automated Bit Mapping Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ACMEN" edc:desc="Automated Character Mapping Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTST" edc:desc="Contrast Adjustment" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="LPPM" edc:desc="LCD Power Macro Power mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="AUTO" edc:desc="LCD power automatically select regualation mode or pump mode" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="STEPUP" edc:desc="LCD power use step-up pump loop only" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="STEPDOWN" edc:desc="LCD power use step-down drop-out regulation loop only" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C08" edc:access="nnnn-nnn" edc:cname="CTRLD" edc:impl="0xF7" edc:mclr="10000000" edc:nzwidth="0x8" edc:por="10000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="BLANK" edc:desc="Blank LCD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BLINK" edc:desc="Blinking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSREN" edc:desc="Circular Shift Register Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FC0EN" edc:desc="Frame Counter 0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FC1EN" edc:desc="Frame Counter 1 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FC2EN" edc:desc="Frame Counter 2 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DISPEN" edc:desc="Display enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42003C09" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x42003C0C" edc:access="-----nnn" edc:cname="EVCTRL" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="FC0OEO" edc:desc="Frame Counter 0 Overflow Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FC1OEO" edc:desc="Frame Counter 1 Overflow Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FC2OEO" edc:desc="Frame Counter 2 Overflow Event Output Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C0D" edc:access="--nnnnnn" edc:cname="INTENCLR" edc:impl="0x3F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="FC0O" edc:desc="Frame Counter 0 Overflow Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FC1O" edc:desc="Frame Counter 1 Overflow Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FC2O" edc:desc="Frame Counter 2 Overflow Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VLCDRT" edc:desc="VLCD Ready Toggle Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VLCDST" edc:desc="VLCD Status Toggle Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRST" edc:desc="Pump Run Status Toggle Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C0E" edc:access="--nnnnnn" edc:cname="INTENSET" edc:impl="0x3F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="FC0O" edc:desc="Frame Counter 0 Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FC1O" edc:desc="Frame Counter 1 Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FC2O" edc:desc="Frame Counter 2 Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VLCDRT" edc:desc="VLCD Ready Toggle Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VLCDST" edc:desc="VLCD Status Toggle Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRST" edc:desc="Pump Run Status Toggle Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C0F" edc:access="--nnnnnn" edc:cname="INTFLAG" edc:impl="0x3F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="FC0O" edc:desc="Frame Counter 0 Overflow" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FC1O" edc:desc="Frame Counter 1 Overflow" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FC2O" edc:desc="Frame Counter 2 Overflow" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VLCDRT" edc:desc="VLCD Ready Toggle" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VLCDST" edc:desc="VLCD Status Toggle" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRST" edc:desc="Pump Run Status Toggle" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
