Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML22_DFP/3.2.39/edc/ATSAML22G18A.PIC
      <edc:AdjustPoint edc:_addr="0x42003C71" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x42003C74" edc:access="nnnnnnnnn-nnnnnnnnnnnnnnnnnn-nnn" edc:cname="ACMCFG" edc:impl="0xFFBFFFF7" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="NCOM" edc:desc="COM Lines per Row" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NDIG" edc:desc="Number of Digit" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="STEPS" edc:desc="Scrolling Steps" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="NDROW" edc:desc="Number of Digit per Row" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MODE" edc:desc="Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SEQ" edc:desc="Sequential Display Mode" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SCROLL" edc:desc="Scrolling Display Mode" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="STSEG" edc:desc="Start SEG Line" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="FCS" edc:desc="Frame Counter Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FC0" edc:desc="Frame Counter 0" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="FC1" edc:desc="Frame Counter 1" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FC2" edc:desc="Frame Counter 2" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C78" edc:access="nnnnnnnn" edc:cname="ABMCFG" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="FCS" edc:desc="Frame Counter Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FC0" edc:desc="Frame Counter 0" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="FC1" edc:desc="Frame Counter 1" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FC2" edc:desc="Frame Counter 2" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SIZE" edc:desc="Size" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42003C79" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x42003C7C" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:cname="CMDATA" edc:impl="0xFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="SDATA" edc:desc="Segments Data" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C80" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CMDMASK" edc:impl="0xFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="SDMASK" edc:desc="Segments Data Mask" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C84" edc:access="-----nnn--nnnnnn" edc:cname="CMINDEX" edc:impl="0x73F" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="SINDEX" edc:desc="SEG Line Index" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CINDEX" edc:desc="COM Line Index" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42003C86" edc:offset="0x37A"/>
      <edc:SFRDef edc:_addr="0x42004000" edc:access="------------nnnn-nnnnnnnnnnnnnnn" edc:cname="CTRLA" edc:impl="0xF7FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AESMODE" edc:desc="AES Modes of operation" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="CFBS" edc:desc="CFB Types" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="KEYSIZE" edc:desc="Keysize" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="CIPHER" edc:desc="Cipher mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STARTMODE" edc:desc="Start mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOD" edc:desc="LOD Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KEYGEN" edc:desc="Last key generation" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="XORKEY" edc:desc="Xor Key operation" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CTYPE" edc:desc="Counter measure types" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42004004" edc:access="----nnnn" edc:cname="CTRLB" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="START" edc:desc="Manual Start" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NEWMSG" edc:desc="New message" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOM" edc:desc="End of message" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GFMUL" edc:desc="GF Multiplication" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42004005" edc:access="------nn" edc:cname="INTENCLR" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="ENCCMP" edc:desc="Encryption Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GFMCMP" edc:desc="GF Multiplication Complete" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42004006" edc:access="------nn" edc:cname="INTENSET" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="ENCCMP" edc:desc="Encryption Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GFMCMP" edc:desc="GF Multiplication Complete" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42004007" edc:access="------nn" edc:cname="INTFLAG" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="ENCCMP" edc:desc="Encryption Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GFMCMP" edc:desc="GF Multiplication Complete" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42004008" edc:access="------nn" edc:cname="DATABUFPTR" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="INDATAPTR" edc:desc="Input Data Pointer" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42004009" edc:access="-------w" edc:cname="DBGCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="DBGRUN" edc:desc="Debug Run" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4200400A" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x4200400C" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="KEYWORD0" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x42004010" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="KEYWORD1" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x42004014" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="KEYWORD2" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x42004018" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="KEYWORD3" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x4200401C" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="KEYWORD4" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x42004020" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="KEYWORD5" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x42004024" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="KEYWORD6" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x42004028" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="KEYWORD7" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:AdjustPoint edc:_addr="0x4200402C" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x42004038" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="INDATA" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x4200403C" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="INTVECTV0" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x42004040" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="INTVECTV1" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x42004044" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="INTVECTV2" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x42004048" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="INTVECTV3" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:AdjustPoint edc:_addr="0x4200404C" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x4200405C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HASHKEY0" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x42004060" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HASHKEY1" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x42004064" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HASHKEY2" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x42004068" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HASHKEY3" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x4200406C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GHASH0" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x42004070" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GHASH1" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x42004074" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GHASH2" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x42004078" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GHASH3" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:AdjustPoint edc:_addr="0x4200407C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x42004080" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CIPLEN" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:SFRDef edc:_addr="0x42004084" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RANDSEED" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES"/>
      <edc:AdjustPoint edc:_addr="0x42004088" edc:offset="0x378"/>
      <edc:SFRDef edc:_addr="0x42004400" edc:access="-n----n-" edc:cname="CTRLA" edc:impl="0x42" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TRNG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRNG">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42004401" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x42004404" edc:access="-------n" edc:cname="EVCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TRNG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRNG">
            <edc:SFRFieldDef edc:cname="DATARDYEO" edc:desc="Data Ready Event Output" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42004405" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x42004408" edc:access="-------n" edc:cname="INTENCLR" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TRNG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRNG">
            <edc:SFRFieldDef edc:cname="DATARDY" edc:desc="Data Ready Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42004409" edc:access="-------n" edc:cname="INTENSET" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TRNG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRNG">
            <edc:SFRFieldDef edc:cname="DATARDY" edc:desc="Data Ready Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4200440A" edc:access="-------n" edc:cname="INTFLAG" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TRNG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRNG">
            <edc:SFRFieldDef edc:cname="DATARDY" edc:desc="Data Ready Interrupt Flag" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4200440B" edc:offset="0x15"/>
      <edc:SFRDef edc:_addr="0x42004420" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DATA" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TRNG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRNG">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Output Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42004424" edc:offset="0x3DC"/>
      <edc:SFRDef edc:_addr="0x42004800" edc:access="-n----nn" edc:cname="CTRL" edc:impl="0x43" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="CCL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CCL">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="The peripheral is not reset" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The peripheral is reset" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="The peripheral is disabled" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The peripheral is enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Generic clock is not required in standby sleep mode" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="Generic clock is required in standby sleep mode" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
